app/Models/Kategori.php

SELECT *
FROM `kategori`
---
    public function getKendaraanGroupByKategori()
    {
        $kendaraanModel = new kendaraanModel();
        $kategoriKendaraan = $this->findAll();